#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

Show Plan

```terraform
data.aws_vpc.default: Reading...
data.aws_vpc.default: Read complete after 0s [id=vpc-02cf77850c2df5be1]
data.aws_subnets.default_vpc: Reading...
data.aws_subnets.default_vpc: Read complete after 0s [id=us-east-2]
data.aws_subnet.subnet_details["subnet-085aa49c5835968bd"]: Reading...
data.aws_subnet.subnet_details["subnet-03a5266624fa2c71d"]: Reading...
data.aws_subnet.subnet_details["subnet-09619505e4e8fc63f"]: Reading...
data.aws_subnet.subnet_details["subnet-085aa49c5835968bd"]: Read complete after 1s [id=subnet-085aa49c5835968bd]
data.aws_subnet.subnet_details["subnet-03a5266624fa2c71d"]: Read complete after 1s [id=subnet-03a5266624fa2c71d]
data.aws_subnet.subnet_details["subnet-09619505e4e8fc63f"]: Read complete after 1s [id=subnet-09619505e4e8fc63f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_subnet_group.ben-subnet-group will be created
  + resource "aws_db_subnet_group" "ben-subnet-group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "ben-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-03a5266624fa2c71d",
          + "subnet-09619505e4e8fc63f",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "ben-subnet-group"
        }
      + tags_all                = {
          + "Name" = "ben-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_security_group.mysql will be created
  + resource "aws_security_group" "mysql" {
      + arn                    = (known after apply)
      + description            = "Security group for MySQL RDS instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "mysql-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "mysql-sg"
        }
      + tags_all               = {
          + "Name" = "mysql-sg"
        }
      + vpc_id                 = "vpc-02cf77850c2df5be1"
    }

  # module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_target                         = (known after apply)
      + backup_window                         = "02:00-03:30"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "mydb"
      + db_subnet_group_name                  = "ben-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mariadb"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "my-database"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:04:00-sun:04:30"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Environment" = "dev"
          + "Project"     = "myproject"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "Project"     = "myproject"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```



*Pusher: @benj58xu, Action: `pull_request`, Workflow: `Pull Request Main`*